In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.options.display.max_rows = None
pd.options.display.max_columns = None

Importer le fichier CSV contenant le dataset des dépenses communales dans le notebook

In [3]:
data = pd.read_csv('ts-b-ssv-18.03.05-2021-modifier.csv', sep=';')

Afficher les 5 premières lignes du dataset

In [4]:
data.head()

   GEONR GEONAME  CLASS_HAB      VARIABLE     VALUE STATUS
0   2701   Basel          6        depc_t  319492.0      A
1   2701   Basel          6  depc_pat_cul   89279.0      A
2   2701   Basel          6     depc_cula   96742.0      A
3   2701   Basel          6      depc_med       0.0      A
4   2701   Basel          6      depc_spo  133339.0      A

Nombre de lignes dans le dataset

In [5]:
len(data)

2052

les valeurs uniques de la colonne CLASS_HAB

In [6]:
data['CLASS_HAB'].unique()

array([6, 5, 4, 3, 2, 1], dtype=int64)

Afficher les duplications dans tout le dataset

In [7]:
data.duplicated().sum()

0

Afficher les duplications par colonne

In [8]:
for col in data.columns:
    print(col,' : ',data[col].duplicated().sum())

GEONR  :  1881
GEONAME  :  1881
CLASS_HAB  :  2046
VARIABLE  :  2040
VALUE  :  1112
STATUS  :  2049

Afficher les duplications en prenant en compte les colonnes GEONR, VARIABLE et VALUE

In [9]:
data[['GEONR','VARIABLE','VALUE']].duplicated().sum()

0

Nombre de valeurs manquantes par colonne

In [10]:
data.isnull().sum()

GEONR         0
GEONAME       0
CLASS_HAB     0
VARIABLE      0
VALUE        19
STATUS        0
dtype: int64

Afficher les valeurs nulles de l'attribut VALUE

In [11]:
data[data['VALUE'].isnull()]

      GEONR                 GEONAME  CLASS_HAB       VARIABLE  VALUE STATUS
1165   3271              Buchs (SG)          2   depc_pat_cul    NaN      N
1477   2937  Neuhausen am Rheinfall          2   depc_pat_cul    NaN      N
1549   5589                  Prilly          2   depc_pat_cul    NaN      N
1680   4012                    Suhr          2         depc_t    NaN      M
1681   4012                    Suhr          2   depc_pat_cul    NaN      M
1682   4012                    Suhr          2      depc_cula    NaN      M
1683   4012                    Suhr          2       depc_med    NaN      M
1684   4012                    Suhr          2       depc_spo    NaN      M
1685   4012                    Suhr          2       depc_egl    NaN      M
1686   4012                    Suhr          2        depic_t    NaN      M
1687   4012                    Suhr          2  depic_pat_cul    NaN      M
1688   4012                    Suhr          2     depic_cula    NaN      M
1689   4012                    Suhr          2      depic_med    NaN      M
1690   4012                    Suhr          2      depic_spo    NaN      M
1691   4012                    Suhr          2      depic_egl    NaN      M
1765    627                    Worb          2   depc_pat_cul    NaN      N
1789    361              Zollikofen          2   depc_pat_cul    NaN      N
1851   3921                   Arosa          1       depc_med    NaN      N
1857   3921                   Arosa          1      depic_med    NaN      N

Supprimer toutes les lignes contenant des valeurs manquantes dans la colonne VALUE

In [12]:
new_data = data.drop(data[data['VALUE'].isnull()].index)

Compter le nombre de valeurs manquantes pour chaque colonne

In [13]:
new_data.isnull().sum()

GEONR        0
GEONAME      0
CLASS_HAB    0
VARIABLE     0
VALUE        0
STATUS       0
dtype: int64

Afficher les valeurs uniques de la colonne status

In [14]:
new_data.STATUS.unique()

array(['A'], dtype=object)

Suppression des colonnes Status et GEONR

In [15]:
new_data = new_data.drop(['STATUS','GEONR', 'CLASS_HAB'], axis=1)

Afficher les 5 premières lignes

In [16]:
new_data.head()

  GEONAME      VARIABLE     VALUE
0   Basel        depc_t  319492.0
1   Basel  depc_pat_cul   89279.0
2   Basel     depc_cula   96742.0
3   Basel      depc_med       0.0
4   Basel      depc_spo  133339.0

Sélectionner toutes les lignes relatives à la dépense totale et supprimer la colonne VARIABLE

In [17]:
new_data_selected = new_data[new_data['VARIABLE']=='depc_t']
new_data_selected = new_data_selected.drop(['VARIABLE'], axis=1)
new_data_selected.head()

       GEONAME     VALUE
0        Basel  319492.0
12        Bern   90344.0
24      Genève  425099.0
36    Lausanne  192444.0
48  Winterthur   69627.0

Afficher le nombre de duplications

In [18]:
new_data_selected.duplicated().sum()

0

Afficher le nombre de duplications dans la colonne GEONAME

In [19]:
new_data_selected['GEONAME'].duplicated().sum()

0

Afficher les valeurs uniques de la colonne GEONAME

In [20]:
new_data_selected['GEONAME'].unique()

array(['Basel', 'Bern', 'Genève', 'Lausanne', 'Winterthur', 'Zürich',
       'Biel/Bienne', 'Lugano', 'Luzern', 'St. Gallen', 'Aarau',
       'Allschwil', 'Baar', 'Bellinzona', 'Bülach', 'Bulle',
       'Carouge (GE)', 'Chur', 'Dietikon', 'Dübendorf', 'Emmen',
       'Frauenfeld', 'Fribourg', 'Horgen', 'Kloten', 'Köniz',
       'Kreuzlingen', 'Kriens', 'La Chaux-de-Fonds', 'Lancy', 'Meyrin',
       'Montreux', 'Neuchâtel', 'Nyon', 'Opfikon', 'Rapperswil-Jona',
       'Renens (VD)', 'Riehen', 'Schaffhausen', 'Sion', 'Thun', 'Uster',
       'Vernier', 'Wädenswil', 'Wettingen', 'Wetzikon (ZH)', 'Wil (SG)',
       'Yverdon-les-Bains', 'Zug', 'Adliswil', 'Baden', 'Binningen',
       'Burgdorf', 'Cham', 'Einsiedeln', 'Freienbach', 'Glarus Nord',
       'Gossau (SG)', 'Grenchen', 'Herisau', 'Illnau-Effretikon',
       'Langenthal', 'Locarno', 'Lyss', 'Martigny', 'Monthey', 'Morges',
       'Muttenz', 'Olten', 'Onex', 'Ostermundigen', 'Pratteln', 'Pully',
       'Regensdorf', 'Reinach (BL)', 'Schlieren', 'Schwyz', 'Sierre',
       'Solothurn', 'Steffisburg', 'Thalwil', 'Vevey', 'Volketswil',
       'Wallisellen', 'Wohlen (AG)', 'Aesch (BL)', 'Affoltern am Albis',
       'Aigle', 'Altstätten', 'Amriswil', 'Arbon', 'Arth', 'Bassersdorf',
       'Belp', 'Birsfelden', 'Brig-Glis', 'Brugg', 'Buchs (SG)',
       'Chêne-Bougeries', 'Davos', 'Delémont', 'Ebikon', 'Ecublens (VD)',
       'Flawil', 'Gland', 'Glarus', 'Hinwil', 'Horw', 'Ittigen',
       'Küsnacht (ZH)', 'La Tour-de-Peilz', 'Le Grand-Saconnex',
       'Le Locle', 'Lenzburg', 'Liestal', 'Männedorf', 'Meilen',
       'Mendrisio', 'Möhlin', 'Münchenbuchsee', 'Münchenstein',
       'Münsingen', 'Muri bei Bern', 'Neuhausen am Rheinfall',
       'Oberwil (BL)', 'Oftringen', 'Payerne', 'Pfäffikon',
       'Plan-les-Ouates', 'Prilly', 'Rheinfelden', 'Richterswil', 'Risch',
       'Romanshorn', 'Rüti (ZH)', 'Sarnen', 'Spiez', 'Spreitenbach',
       'Stäfa', 'Steinhausen', 'Sursee', 'Thônex', 'Uzwil', 'Versoix',
       'Villars-sur-Glâne', 'Weinfelden', 'Worb', 'Zofingen',
       'Zollikofen', 'Zollikon', 'Altdorf (UR)', 'Appenzell', 'Arlesheim',
       'Arosa', 'Bussigny', 'Chiasso', 'Crissier', 'Interlaken',
       'La Neuveville', 'Moutier', 'Murten', 'Peseux', 'Porrentruy',
       'Rorschach', 'St. Moritz', 'Stans', 'Urdorf', 'Visp', 'Zermatt',
       'Zuchwil'], dtype=object)

Importer le fichier avec les communes romandes et en renommant la colonne en nom au lieu de 0

In [21]:
data_romande = pd.read_csv('communes_romandes_nettoyes.csv',sep=';')
data_romande = data_romande.drop(['canton'],axis=1)
data_romande.head()

             nom
0         Aclens
1          Agarn
2          Agiez
3          Aigle
4  Aire-la-Ville

Sélection des dépenses communales en ne récupérant que celles des communes romandes

In [22]:
result = []
for i in new_data_selected.iterrows():
    for j in data_romande.iterrows():
        if i[1]['GEONAME'] == j[1]['nom']:
            geoname = i[1]['GEONAME']
            value = i[1]['VALUE']
            result.append([geoname, value])

Transformer la liste obtenue ci-dessus en un dataframe

In [23]:
result_df = pd.DataFrame(result, columns=['nom','depense_total'])

Afficher les 5 premières lignes

In [24]:
result_df.head()

            nom  depense_total
0        Genève       425099.0
1      Lausanne       192444.0
2         Bulle         9869.0
3  Carouge (GE)        28831.0
4      Fribourg        13981.0

Transformer en fichier CSV le résultat final

In [25]:
new_data.to_csv('depenses_communales_nettoyes.csv',sep=';',index=False,encoding='UTF-8')